[
{"id": "1902.00004", "title": ["\nHigh-Dimensional Uncertainty Quantification of Electronic and Photonic  IC with Non-Gaussian Correlated Process Variations"], "authors": ["Chunfeng Cui", "Zheng Zhang"], "abstract": [" Uncertainty quantification based on generalized polynomial chaos has been\nused in many applications. It has also achieved great success in\nvariation-aware design automation. However, almost all existing techniques\nassume that the parameters are mutually independent or Gaussian correlated,\nwhich is rarely true in real applications. For instance, in chip manufacturing,\nmany process variations are actually correlated. Recently, some techniques have\nbeen developed to handle non-Gaussian correlated random parameters, but they\nare time-consuming for high-dimensional problems. We present a new framework to\nsolve uncertainty quantification problems with many non-Gaussian correlated\nuncertainties. Firstly, we propose a set of smooth basis functions to well\ncapture the impact of non-Gaussian correlated process variations. We develop a\ntensor approach to compute these basis functions in a high-dimension setting.\nSecondly, we investigate the theoretical aspect and practical implementation of\na sparse solver to compute the coefficients of all basis functions. We provide\nsome theoretical analysis for the exact recovery condition and error bound of\nthis sparse solver in the context of uncertainty quantification. We present\nthree adaptive sampling approaches to improve the performance of the sparse\nsolver. Finally, we validate our methods by synthetic and practical\nelectronic/photonic ICs with 19 to 57 non-Gaussian correlated variation\nparameters. Our approach outperforms Monte Carlo by thousands of times in terms\nof efficiency. It can also accurately predict the output density functions with\nmultiple peaks caused by non-Gaussian correlations, which are hard to capture\nby existing methods.\n"], "primary_subject": ["Numerical Analysis (math.NA)"], "subjects": ["Numerical Analysis (math.NA)"]},
{"id": "1902.00002", "title": ["\nUncertainty Quantification in Molecular Signals using Polynomial Chaos  Expansion"], "authors": ["Mahmoud Abbaszadeh", "Giannis Moutsinas", "Peter J. Thomas", "Weisi Guo"], "abstract": [" Molecular signals are abundant in engineering and biological contexts, and\nundergo stochastic propagation in fluid dynamic channels. The received signal\nis sensitive to a variety of input and channel parameter variations. Currently\nwe do not understand how uncertainty or noise in a variety of parameters affect\nthe received signal concentration, and nor do we have an analytical framework\nto tackle this challenge. In this paper, we utilize Polynomial Chaos Expansion\n(PCE) to show to uncertainty in parameters propagates to uncertainty in the\nreceived signal. In demonstrating its applicability, we consider a Turbulent\nDiffusion Molecular Communication (TDMC) channel and highlight which parameters\naffect the received signals. This can pave the way for future information\ntheoretic insights, as well as guide experimental design.\n"], "primary_subject": ["Computational Physics (physics.comp-ph)"], "subjects": ["Computational Physics (physics.comp-ph)", "Other Statistics (stat.OT)"]},
{"id": "1902.00003", "title": ["\nStable pairs and Gopakumar-Vafa type invariants for Calabi-Yau 4-folds"], "authors": ["Yalong Cao", "Davesh Maulik", "Yukinobu Toda"], "abstract": [" As an analogy to Gopakumar-Vafa conjecture on CY 3-folds, Klemm-Pandharipande\ndefined GV type invariants on CY 4-folds using GW theory and conjectured their\nintegrality. In this paper, we define stable pair type invariants on CY 4-folds\nand use them to interpret these GV type invariants. Examples are computed for\nboth compact and non-compact CY 4-folds to support our conjectures.\n"], "primary_subject": ["Algebraic Geometry (math.AG)"], "subjects": ["Algebraic Geometry (math.AG)", "High Energy Physics - Theory (hep-th)", "Mathematical Physics (math-ph)"]},
{"id": "1902.00006", "title": ["\nAn Evaluation of the Human-Interpretability of Explanation"], "authors": ["Isaac Lage", "Emily Chen", "Jeffrey He", "Menaka Narayanan", "Been Kim", "Sam Gershman", "Finale Doshi-Velez"], "abstract": [" Recent years have seen a boom in interest in machine learning systems that\ncan provide a human-understandable rationale for their predictions or\ndecisions. However, exactly what kinds of explanation are truly\nhuman-interpretable remains poorly understood. This work advances our\nunderstanding of what makes explanations interpretable under three specific\ntasks that users may perform with machine learning systems: simulation of the\nresponse, verification of a suggested response, and determining whether the\ncorrectness of a suggested response changes under a change to the inputs.\nThrough carefully controlled human-subject experiments, we identify\nregularizers that can be used to optimize for the interpretability of machine\nlearning systems. Our results show that the type of complexity matters:\ncognitive chunks (newly defined concepts) affect performance more than variable\nrepetitions, and these trends are consistent across tasks and domains. This\nsuggests that there may exist some common design principles for explanation\nsystems.\n"], "primary_subject": ["Machine Learning (cs.LG)"], "subjects": ["Machine Learning (cs.LG)", "Machine Learning (stat.ML)"]},
{"id": "1902.00001", "title": ["\nHot Exoplanet Atmospheres Resolved with Transit Spectroscopy (HEARTS) -  II. A broadened sodium feature on the ultra-hot giant WASP-76b"], "authors": ["J. V. Seidel", "D. Ehrenreich", "A. Wyttenbach", "R. Allart", "M. Lendl", "L. Pino", "V. Bourrier", "H. M. Cegla", "C. Lovis", "D. Barrado", "D. Bayliss", "N. Astudillo-Defru", "A. Deline", "C. Fisher", "K. Heng", "R. Joseph", "B. Lavie", "C. Melo", "F. Pepe", "D. Ségrasan", "S. Udry"], "abstract": [" High-resolution optical spectroscopy is a powerful tool to characterise\nexoplanetary atmospheres from the ground. The sodium D lines, with their large\ncross sections, are especially suited to study the upper layers of atmospheres\nin this context. We report on the results from HEARTS, a spectroscopic survey\nof exoplanet atmospheres, performing a comparative study of hot gas giants to\ndetermine the effects of stellar irradiation. In this second installation of\nthe series, we highlight the detection of neutral sodium on the ultra-hot giant\nWASP-76b. We observed three transits of the planet using the HARPS\nhigh-resolution spectrograph at the ESO 3.6m telescope and collected 175\nspectra of WASP-76. We repeatedly detect the absorption signature of neutral\nsodium in the planet atmosphere ($0.371\\pm0.034\\%$; $10.75 \\sigma$ in a $0.75$\n\\r{A} passband). The sodium lines have a Gaussian profile with full width at\nhalf maximum (FWHM) of $27.6\\pm2.8$ km s$^{-1}$. This is significantly broader\nthan the line spread function of HARPS ($2.7$ km s$^{-1}$). We surmise that the\nobserved broadening could trace the super-rotation in the upper atmosphere of\nthis ultra-hot gas giant.\n"], "primary_subject": ["Earth and Planetary Astrophysics (astro-ph.EP)"], "subjects": ["Earth and Planetary Astrophysics (astro-ph.EP)"]},
{"id": "1902.00008", "title": ["\nAnalysis of hidden-bottom bb\\bar{b}\\bar{b} states"], "authors": ["Xiaoyun Chen"], "abstract": [" Motivated by the searching for $bb\\bar{b}\\bar{b}$ states at LHC recently, we\ncalculate the ground-state energies of $bb\\bar{b}\\bar{b}$ states with quantum\nnumbers $IJ^P=00^+,01^+,02^+$ in a nonrelativistic chiral quark model using the\nGaussian expansion method. In our calculations, two structures, meson-meson and\ndiquark-antidiquark, and their coupling, along with all possible color\nconfigurations are considered. It is expected that the studies shall be helpful\nfor the experimental searching of fully-heavy exotic tetraquark states.\n"], "primary_subject": ["High Energy Physics - Phenomenology (hep-ph)"], "subjects": ["High Energy Physics - Phenomenology (hep-ph)"]},
{"id": "1902.00005", "title": ["\nDust trapping in protoplanetary disks"], "authors": ["Nienke van der Marel"], "abstract": [" Planet formation is thought to begin with the growth of dust particles in\nprotoplanetary disks from micrometer to millimeter and centimeter sizes. Dust\ngrowth is hindered by a number of growth barriers, according to dust evolution\ntheory, while observational evidence indicates that somehow these barriers must\nhave been overcome. The observational evidence of dust traps, in particular the\nOph IRS 48 disk, with the Atacama Large Millimeter/submillimeter Array (ALMA)\nhas changed our view of the dust growth process. In this article I review the\nhistory of dust trapping in models and observations.\n"], "primary_subject": ["Earth and Planetary Astrophysics (astro-ph.EP)"], "subjects": ["Earth and Planetary Astrophysics (astro-ph.EP)"]},
{"id": "1902.00007", "title": ["\nProperties of minimal charts and their applications V: charts of type  $(3,2,2)$"], "authors": ["Teruo Nagase", "Akiko Shima"], "abstract": [" Let $\\Gamma$ be a chart, and we denote by $\\Gamma_m$ the union of all the\nedges of label $m$. A chart $\\Gamma$ is of type $(3,2,2)$ if there exists a\nlabel $m$ such that $w(\\Gamma)=7$, $w(\\Gamma_m\\cap\\Gamma_{m+1})=3$,\n$w(\\Gamma_{m+1}\\cap\\Gamma_{m+2})=2$, and $w(\\Gamma_{m+2}\\cap\\Gamma_{m+3})=2$\nwhere $w(G)$ is the number of white vertices in $G$. In this paper, we prove\nthat there is no minimal chart of type $(3,2,2)$.\n"], "primary_subject": ["Geometric Topology (math.GT)"], "subjects": ["Geometric Topology (math.GT)"]},
{"id": "1902.00009", "title": ["\nDescriptor system techniques and software tools"], "authors": ["Andreas Varga"], "abstract": [" The role of the descriptor system representation as basis for reliable\nnumerical computations for system analysis and synthesis, and in particular,\nfor the manipulation of rational matrices, is discussed and available robust\nnumerical software tools are described.\n"], "primary_subject": ["Systems and Control (eess.SY)"], "subjects": ["Systems and Control (eess.SY)"]}
]